In [2]:
import pyodbc
import pandas as pd

In [3]:
pyodbc.drivers()

['SQL Server',
 'SQL Server Native Client 11.0',
 'ODBC Driver 11 for SQL Server',
 'PostgreSQL ANSI(x64)',
 'PostgreSQL Unicode(x64)',
 'ODBC Driver 17 for SQL Server',
 'Amazon Redshift (x64)',
 'MySQL ODBC 8.0 ANSI Driver',
 'MySQL ODBC 8.0 Unicode Driver',
 'Microsoft Access Driver (*.mdb, *.accdb)',
 'Microsoft Excel Driver (*.xls, *.xlsx, *.xlsm, *.xlsb)',
 'Microsoft Access Text Driver (*.txt, *.csv)']

In [4]:
conn=pyodbc.connect(
                 Trusted_connection='yes',
                 Driver='SQL Server Native Client 11.0',
                 Server='DESKTOP-11KNG3S',
                 Database='Airline_Analysis')

cursor=conn.cursor()

In [7]:
import os
os.chdir(r'E:\Portfolio\Flight Prediction Ineuron\Dataset')

In [8]:
df=pd.read_csv("Clean_Dataset.csv")

In [9]:
df.head()

,Unnamed: 0,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1,5953
1,1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1,5953
2,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,1,5956
3,3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,1,5955
4,4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,1,5955

In [10]:
df.columns

Index(['Unnamed: 0', 'airline', 'flight', 'source_city', 'departure_time',
       'stops', 'arrival_time', 'destination_city', 'class', 'duration',
       'days_left', 'price'],
      dtype='object')

In [61]:
cursor.execute("CREATE TABLE FLIGHTD ( Unnamed_0 FLOAT, airline NVARCHAR(50), flight NVARCHAR(50), source_city NVARCHAR(50), departure_time NVARCHAR(50),stops NVARCHAR(50), arrival_time NVARCHAR(50), destination_city NVARCHAR(50), class NVARCHAR(50), duration FLOAT,days_left INTEGER, price INTEGER)")

ProgrammingError: ('42S01', "[42S01] [Microsoft][ODBC Driver 17 for SQL Server][SQL Server]There is already an object named 'FLIGHTD' in the database. (2714) (SQLExecDirectW)")

In [77]:
for row in df.itertuples():
        cursor.execute('''
                    INSERT INTO Test.dbo.FLIGHTD (Unnamed_0,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price)
                    VALUES (?,?,?,?,?,?,?,?,?,?,?,?)
                    ''',
                    row.Unnamed_0,
                    row.airline,
                    row.flight,
                    row.source_city,
                    row.departure_time,
                    row.stops,
                    row.arrival_time,
                    row.destination_city,
                    row.class,
                    row.duration,
                    row.days_left,
                    row.price
                    )
conn.commit()

SyntaxError: invalid syntax (14690156.py, line 14)